Revit 2024 API
BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeRefsWarning Property
 Cannot create reference objects for a DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateDirectShapeRefsWarning { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateDirectShapeRefsWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateDirectShapeRefsWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace